{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Science",
      "department": "Lassonde School of Computer Science and Electrical Engineering",
      "duration": "2015-2021",
      "school_name": "York University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_HunainKhalid",
  "highlighted_projects": [
    {
      "description": "Created a personal portfolio (hunain.dev) using next.js and tailwind.js. Deployed on Vercel for hybrid static site generation, improved loading times and safety. Continuous integration, improvements and  version control are done from Git and Vercel.",
      "git_url": "",
      "name": "Portfolio(Personal) Website"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a linux cluster monitoring agent for the Jarvis Cluster Team (JCT).The application sends reports of server usage to the JCT. Reports determine whether to add or remove servers. Implemented in CentOS7, using a Docker container with an attached PSQL instance and IntelliJ's bash script extension. Scripts and SQL code are sent to Jarvis remote servers. Once sent, monitoring of database insertions was done in real-time through database viewer, DBeaver. Testing was done manually. All code is deployed to the git url above.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": [
        "Grep App: Developed a Java application simulating Linux (grep) functionality. A Linux command that allows searching of various text-patterns in files or files themselves. Implemented using Java libraries FileReader, Filewriter, BufferedReader,BufferedWriter and Lanbda expressions. Built with Maven in Intellij's platform. This project resides in a docker container, pushed to Docker Hub.",
        "",
        ""
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Hunain Khalid",
  "others": [
    {
      "bullets": [
        "Kaggle.com: Python Course (2021)",
        "CodeWithMosh.com: Mastering Docker (2021)",
        "CodeWithMosh.com: Mastering React (2020)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Directed, Acted, Produced Short Films",
        "Organized Video Gaming Events"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consultancy Group",
      "description": "Worked as a software developer developing projects on Linux CentOS7 using SQL, RDBMS, Docker, Maven and Github, in an agile environment. Actively participated in daily scrum meetings, often collaborating and helping each other to find soluions. Code review sessions and sprint retro meetings with senior developers helped me understand the agile/scrum developmentcycle further.",
      "duration": "2021-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "ReactJS/GatsbyJS/NextJS",
      "AngularJS",
      "Python",
      "Android"
    ],
    "familiar": [
      "C programming language",
      "Numpy",
      "UX/UI design",
      "Advanced Object Oriented Programming",
      "Kotlin",
      "Pandas"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/Github"
    ]
  },
  "summary": "I am a recent graduate from York University's Computer Science program. I specialize in software development, from compiler-level code to machine learning. Although proficient, I continue to improve my skills in Docker, Java, SQL, Python, React.js, Git, Linux and more. As a full-stack software developer, I solve problems quickly, with optimized run time and extensive documentation. A course on computer security helped with enterprise-level solutions to computer security and security at the programming level. I am also an excellent communicator, team member and leader. Currently employed at Jarvis, I improve my skills through difficult projects and team collaboration in an agile environment."
}
