{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Science",
      "department": "Lassonde School of Computer Science",
      "duration": "2015-2021",
      "school_name": "York University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_HunainKhalid",
  "highlighted_projects": [
    {
      "description": "Created a personal portfolio (hunain.dev) using next.js and tailwind.js. Deployed on Vercel for hybrid static site generation, improved loading times and safety. Continuous integration, improvements and version control are done through Git and Vercel.",
      "git_url": "",
      "name": "Portfolio (Personal) Website"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux cluster monitoring agent to monitor and analyze server hardware usages in real-time using Bash scripts, PostgreSQL, and Docker. Crontab was added and collected system information per minute using Bash scripts. Used DBeaver to monitor database insertions in real-time. Version control is done through Git and Github. SQL queries report average server usage via gathered data from Bash scripts for data analytic purposes.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": [
        "Grep App: Developed a Java application simulating Linux (grep) allowing users to search for various text-patterns using regex. Implemented using Java libraries FileReader, FileWriter, BufferedReader, BufferedWriter, Stream and Lambda expressions. Built with Maven in Intellij's IDE. This project resides in a docker container, pushed to Docker Hub.",
        "",
        ""
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Hunain Khalid",
  "others": [
    {
      "bullets": [
        "Kaggle.com: Python Course (2021)",
        "CodeWithMosh.com: Mastering Docker (2021)",
        "CodeWithMosh.com: Mastering React (2020)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Directed, Acted, Produced Short Films",
        "Organized Video Gaming Events"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consultancy Group",
      "description": "Worked as a software developer developing projects using Java, Linux, RDBMS/SQL, Docker, Maven, Git, Gitflow and Github all in an agile environment. Actively participated in daily scrum meetings, often collaborating and helping team members solve problems in innovative ways. Organized code review sessions and scrum meetings to deliver high-quality work.",
      "duration": "2021-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "ReactJS/GatsbyJS/NextJS",
      "AngularJS",
      "Python",
      "Android"
    ],
    "familiar": [
      "Kotlin",
      "Numpy",
      "Pandas",
      "Advanced OOP",
      "C",
      "UX/UI"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/Github"
    ]
  },
  "summary": "I am a recent graduate from York University's Computer Science program. I specialize in software development, including full-stack development, compiler-level coding and machine learning. Although proficient, I continue to improve my skills in Docker, Java, SQL, Python, React.js, Git, Linux and more. As a full-stack software developer, I solve problems quickly, with optimized run time and extensive documentation. A course on computer security helped with enterprise-level solutions to computer security and security at the programming level. I am also an excellent communicator, team member and leader. Currently employed at Jarvis, I improve my skills through challenging projects and team collaboration in an agile environment."
}
